# Current Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSetIterator..::..Current Property
ElectricalSystemSetIterator Class See Also
---
Retrieves the item that is the current focus of the iterator.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual Object Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As Object
	Get
```

Visual C++
---
```text
public:
virtual property Object^ Current {
	Object^ get ();
}
```

# ### Implements
IEnumerator..::..Current
# Remarks
A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.
# See Also
ElectricalSystemSetIterator Class
Autodesk.Revit.DB.Electrical Namespace